
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Delete
  * azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY will be destroyed
  # (because azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY is not in configuration)
  - resource "azurerm_key_vault_secret" "AZURE_APPINSGHTS_KEY" {
      - id                      = "https://aac-prod.vault.azure.net/secrets/AppInsightsInstrumentationKey/6bb3ba95b92b4c5b88504bdeff42d755" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/aac-manage-case-assignment-prod/providers/Microsoft.KeyVault/vaults/aac-prod" -> null
      - name                    = "AppInsightsInstrumentationKey" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/aac-manage-case-assignment-prod/providers/Microsoft.KeyVault/vaults/aac-prod/secrets/AppInsightsInstrumentationKey/versions/6bb3ba95b92b4c5b88504bdeff42d755" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/aac-manage-case-assignment-prod/providers/Microsoft.KeyVault/vaults/aac-prod/secrets/AppInsightsInstrumentationKey" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      - version                 = "6bb3ba95b92b4c5b88504bdeff42d755" -> null
      - versionless_id          = "https://aac-prod.vault.azure.net/secrets/AppInsightsInstrumentationKey" -> null
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/aac-manage-case-assignment-prod/providers/Microsoft.KeyVault/vaults/aac-prod"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":568,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->